In [143]:
import pandas as pd

df = pd.read_csv("Ecommers_data_updated.csv", sep=";")

## Series

Series adalah struktur yang mirip seperti array

In [144]:
Nilai_ujian = pd.Series([80, 90, 100, 40], name="Nilai Matematika")
print(Nilai_ujian)

0     80
1     90
2    100
3     40
Name: Nilai Matematika, dtype: int64

## Data inpections method

* to see entire dataframe from the first index

In [145]:
df.head()

,Nama_penerima,No_resi,Nama_ekspedisi,Tanggal_order,Tanggal_pickup,Tanggal_delivered,Status,Nama_toko
0,Taufik Hidayat,10000000,POS,23/01/2023,24/01/2023,26/01/2023,delivered,Nusantara Mart
1,Siti Nurhaliza,10000001,JNE,17/12/2023,18/12/2023,22/12/2023,delivered,Cahaya Elektronik
2,Putri Amelia,10000002,JNT,10/09/2023,11/09/2023,12/09/2023,delivered,Karya Mandiri
3,Siti Nurhaliza,10000003,Sicepat,18/04/2023,21/04/2023,25/04/2023,delivered,Bintang Terang Shop
4,Novita Sari,10000004,JNT,22/04/2023,25/04/2023,26/04/2023,delivered,Sinar Harapan

* to see all column names from the Dataframe

In [146]:
df.columns

Index(['Nama_penerima', 'No_resi', 'Nama_ekspedisi', 'Tanggal_order',
       'Tanggal_pickup', 'Tanggal_delivered', 'Status', 'Nama_toko'],
      dtype='object')

* to see describe from the dataframe

In [147]:
df.describe()

            No_resi
count  5.000000e+02
mean   1.000025e+07
std    1.444818e+02
min    1.000000e+07
25%    1.000012e+07
50%    1.000025e+07
75%    1.000037e+07
max    1.000050e+07

In [148]:
df.tail(3)

,Nama_penerima,No_resi,Nama_ekspedisi,Tanggal_order,Tanggal_pickup,Tanggal_delivered,Status,Nama_toko
497,Kartika Sari,10000497,POS,23/06/2023,24/06/2023,25/06/2023,delivered,Garuda Perkasa
498,Gunawan,10000498,JNE,17/12/2023,18/12/2023,25/12/2023,delivered,Sentosa Cell
499,Cahya Purnama,10000499,JNE,18/09/2023,21/09/2023,28/09/2023,delivered,Duta Niaga

In [149]:
df.shape

(500, 8)

In [150]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Nama_penerima      500 non-null    object
 1   No_resi            500 non-null    int64
 2   Nama_ekspedisi     500 non-null    object
 3   Tanggal_order      500 non-null    object
 4   Tanggal_pickup     500 non-null    object
 5   Tanggal_delivered  423 non-null    object
 6   Status             500 non-null    object
 7   Nama_toko          500 non-null    object
dtypes: int64(1), object(7)
memory usage: 31.4+ KB

## Selection & Indexing Methods

* select by label or index

.loc

In [151]:
pd.set_option("display.max_rows", 5)

# Take the row where the store name is "Karya Mandiri"
df.loc[df["Nama_toko"] == "Karya Mandiri"]

,Nama_penerima,No_resi,Nama_ekspedisi,Tanggal_order,Tanggal_pickup,Tanggal_delivered,Status,Nama_toko
2,Putri Amelia,10000002,JNT,10/09/2023,11/09/2023,12/09/2023,delivered,Karya Mandiri
10,Indra Kusuma,10000010,Sicepat,26/05/2023,28/05/2023,04/06/2023,delivered,Karya Mandiri
...,...,...,...,...,...,...,...,...
471,Gunawan,10000471,JNT,18/05/2023,19/05/2023,24/05/2023,delivered,Karya Mandiri
484,Joko Susilo,10000484,Sicepat,25/11/2023,27/11/2023,NaN,return,Karya Mandiri

In [152]:
pd.set_option("display.max_rows", 10)
df["No_resi"]

0      10000000
1      10000001
2      10000002
3      10000003
4      10000004
         ...
495    10000495
496    10000496
497    10000497
498    10000498
499    10000499
Name: No_resi, Length: 500, dtype: int64

## Data cleaning and transformation method

* .drop()

In [153]:
# delete by condition

# df.drop(df.loc[df["Nama_toko"] == "Karya Mandiri"].index, inplace=True)

# drop by column name

# df.drop(["Status", "Tanggal_order"], axis=1, inplace=True)
df.head()

,Nama_penerima,No_resi,Nama_ekspedisi,Tanggal_order,Tanggal_pickup,Tanggal_delivered,Status,Nama_toko
0,Taufik Hidayat,10000000,POS,23/01/2023,24/01/2023,26/01/2023,delivered,Nusantara Mart
1,Siti Nurhaliza,10000001,JNE,17/12/2023,18/12/2023,22/12/2023,delivered,Cahaya Elektronik
2,Putri Amelia,10000002,JNT,10/09/2023,11/09/2023,12/09/2023,delivered,Karya Mandiri
3,Siti Nurhaliza,10000003,Sicepat,18/04/2023,21/04/2023,25/04/2023,delivered,Bintang Terang Shop
4,Novita Sari,10000004,JNT,22/04/2023,25/04/2023,26/04/2023,delivered,Sinar Harapan

* .rename()

In [154]:
df.rename(columns={"No_resi": "Resi"}, inplace=True)
df.head()

,Nama_penerima,Resi,Nama_ekspedisi,Tanggal_order,Tanggal_pickup,Tanggal_delivered,Status,Nama_toko
0,Taufik Hidayat,10000000,POS,23/01/2023,24/01/2023,26/01/2023,delivered,Nusantara Mart
1,Siti Nurhaliza,10000001,JNE,17/12/2023,18/12/2023,22/12/2023,delivered,Cahaya Elektronik
2,Putri Amelia,10000002,JNT,10/09/2023,11/09/2023,12/09/2023,delivered,Karya Mandiri
3,Siti Nurhaliza,10000003,Sicepat,18/04/2023,21/04/2023,25/04/2023,delivered,Bintang Terang Shop
4,Novita Sari,10000004,JNT,22/04/2023,25/04/2023,26/04/2023,delivered,Sinar Harapan

In [155]:
df["Tanggal_pickup"] = df["Tanggal_pickup"].astype("datetime64[s]")
df.dtypes

Nama_penerima               object
Resi                         int64
Nama_ekspedisi              object
Tanggal_order               object
Tanggal_pickup       datetime64[s]
Tanggal_delivered           object
Status                      object
Nama_toko                   object
dtype: object

* .fillna

In [156]:
# fill missing value
df_fill = df.fillna({"No_resi": 0})

* .dropna

In [157]:
# drop missing value
df_drop = df.dropna()

In [158]:
# replace value

# df_replace = df.replace({"Nama_ekspedisi": {"JNT": "J&T"}})

* .apply()

In [159]:
dff = pd.DataFrame({
    "Nama": ["Aldi", "Budi", "Citra"],
    "Umur": [20, 25, 30]
})

# Tambahkan 5 ke setiap nilai di kolom Umur
dff["Umur_plus5"] = dff["Umur"].apply(lambda x: x + 5)

dfff = pd.DataFrame({
    "Ongkos_kirim": [10000, 15000, 100000],
})

dfff["Fee_shipping"] = dfff["Ongkos_kirim"] * 0.03

print(dfff)

   Ongkos_kirim  Fee_shipping
0         10000         300.0
1         15000         450.0
2        100000        3000.0

## Aggregration and grupping method

In [160]:
df.head()

,Nama_penerima,Resi,Nama_ekspedisi,Tanggal_order,Tanggal_pickup,Tanggal_delivered,Status,Nama_toko
0,Taufik Hidayat,10000000,POS,23/01/2023,2023-01-24,26/01/2023,delivered,Nusantara Mart
1,Siti Nurhaliza,10000001,JNE,17/12/2023,2023-12-18,22/12/2023,delivered,Cahaya Elektronik
2,Putri Amelia,10000002,JNT,10/09/2023,2023-11-09,12/09/2023,delivered,Karya Mandiri
3,Siti Nurhaliza,10000003,Sicepat,18/04/2023,2023-04-21,25/04/2023,delivered,Bintang Terang Shop
4,Novita Sari,10000004,JNT,22/04/2023,2023-04-25,26/04/2023,delivered,Sinar Harapan

In [167]:
pd.set_option("display.max.rows", None)
# data = {
#     "Nama_toko": ["A", "A", "B", "B", "C"],
#     "Kota": ["Jakarta", "Jakarta", "Bandung", "Bandung", "Surabaya"],
#     "Pendapatan": [10000, 15000, 20000, 12000, 18000]
# }
# dfk = pd.DataFrame(data)
# print(df)

# df_grouped = dfk.groupby("Nama_toko")["Pendapatan"].sum()

group_seller = df.groupby("Nama_toko")["Nama_ekspedisi"].count()
print(group_seller)

Nama_toko
Berkah Jaya Store      54
Bintang Terang Shop    44
Cahaya Elektronik      41
Duta Niaga             48
Garuda Perkasa         45
Karya Mandiri          43
Maju Makmur            41
Nusantara Mart         36
Pelangi Fashion        54
Sentosa Cell           49
Sinar Harapan          45
Name: Nama_ekspedisi, dtype: int64

In [171]:
pivot = pd.pivot_table(
    df,
    values="Status",
    index="Nama_toko",
    columns="Nama_ekspedisi",
    aggfunc="count",
)

KPI = pd.pivot_table(
    df,
    values="Nama_ekspedisi",
    index="Nama_toko",
    columns="Status",
    aggfunc="count",   
)

print(KPI)

Status               delivered  return
Nama_toko
Berkah Jaya Store           49       5
Bintang Terang Shop         36       8
Cahaya Elektronik           34       7
Duta Niaga                  44       4
Garuda Perkasa              34      11
Karya Mandiri               37       6
Maju Makmur                 35       6
Nusantara Mart              27       9
Pelangi Fashion             48       6
Sentosa Cell                40       9
Sinar Harapan               39       6

## Merging, Joining, Concatenation Methods

In [174]:
df1 = pd.DataFrame({
    "Id": [1, 2, 3],
    "Nama": ["Aldi", "Budi", "Citra"]
})

df2 = pd.DataFrame({
    "Id": [1, 2, 4],
    "Umur": [20, 25, 30]
})


print(df1.merge(df2, on="Id", how="inner"))
print(df1.merge(df2, on="Id", how="left"))

   Id  Nama  Umur
0   1  Aldi    20
1   2  Budi    25
   Id   Nama  Umur
0   1   Aldi  20.0
1   2   Budi  25.0
2   3  Citra   NaN

## Sorting & Ranking Methods

* Mengurutkan data dari harga terbesar ke terkecil.

In [177]:
harga = pd.DataFrame({
    "Nama_toko": ["A", "B", "C"],
    "Harga": [100000, 20000, 15000]
})

harga.sort_values(by ="Harga", ascending=True)

  Nama_toko   Harga
2         C   15000
1         B   20000
0         A  100000